[Killed] BlockStatement
index.js:3:23
 // MATH UTILITIES ---------------------------------------
 // Function to calculate the factorial of a number.
-function factorial(n) {
-    if (n < 0) throw new Error("Factorial is undefined for negative numbers.");
-    let fact = 1;
-    for (let i = 1; i <= n; i++) {
-        fact *= i;
-    }
-    return fact;
-}
+function factorial(n) {}
 // Function to calculate the greatest common divisor (GCD) of two numbers.
 function gcd(a, b) {
killedBy: Math Utilities Tests factorial of 0 should be 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
index.js:4:9
 // MATH UTILITIES ---------------------------------------
 // Function to calculate the factorial of a number.
 function factorial(n) {
-    if (n < 0) throw new Error("Factorial is undefined for negative numbers.");
+    if (true) throw new Error("Factorial is undefined for negative numbers.");
     let fact = 1;
     for (let i = 1; i <= n; i++) {
killedBy: Math Utilities Tests factorial of 0 should be 1
statusReason: Error: Factorial is undefined for negative numbers.

[Killed] EqualityOperator
index.js:4:9
 // MATH UTILITIES ---------------------------------------
 // Function to calculate the factorial of a number.
 function factorial(n) {
-    if (n < 0) throw new Error("Factorial is undefined for negative numbers.");
+    if (n <= 0) throw new Error("Factorial is undefined for negative numbers.");
     let fact = 1;
     for (let i = 1; i <= n; i++) {
killedBy: Math Utilities Tests factorial of 0 should be 1
statusReason: Error: Factorial is undefined for negative numbers.

[Killed] EqualityOperator
index.js:6:21
 function factorial(n) {
     if (n < 0) throw new Error("Factorial is undefined for negative numbers.");
     let fact = 1;
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i < n; i++) {
         fact *= i;
     }
killedBy: Math Utilities Tests factorial of 5 should be 120
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 24

[Killed] ConditionalExpression
index.js:6:21
 function factorial(n) {
     if (n < 0) throw new Error("Factorial is undefined for negative numbers.");
     let fact = 1;
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; false; i++) {
         fact *= i;
     }
killedBy: Math Utilities Tests factorial of 5 should be 120
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 1

[Killed] AssignmentOperator
index.js:7:9
     if (n < 0) throw new Error("Factorial is undefined for negative numbers.");
     let fact = 1;
     for (let i = 1; i <= n; i++) {
-        fact *= i;
+        fact /= i;
     }
     return fact;
killedBy: Math Utilities Tests factorial of 5 should be 120
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 0.008333333333333333

[Killed] BlockStatement
index.js:12:20
     return fact;
 }
 // Function to calculate the greatest common divisor (GCD) of two numbers.
-function gcd(a, b) {
-    if (a === 0 && b === 0) {
-        throw new Error('GCD is undefined for both zero.');
-    }
-    return b === 0 ? Math.abs(a) : gcd(b, a % b);
-}
+function gcd(a, b) {}
 // Function to calculate the nth Fibonacci number.
 function fibonacci(n) {
killedBy: Math Utilities Tests GCD of 28 and 35 should be 7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: undefined

[Killed] EqualityOperator
index.js:13:20
 }
 // Function to calculate the greatest common divisor (GCD) of two numbers.
 function gcd(a, b) {
-    if (a === 0 && b === 0) {
+    if (a === 0 && b !== 0) {
         throw new Error('GCD is undefined for both zero.');
     }
killedBy: Math Utilities Tests GCD of 0 and 35 should be 35
statusReason: Error: GCD is undefined for both zero.

[Killed] ConditionalExpression
index.js:13:9
 }
 // Function to calculate the greatest common divisor (GCD) of two numbers.
 function gcd(a, b) {
-    if (a === 0 && b === 0) {
+    if (false) {
         throw new Error('GCD is undefined for both zero.');
     }
killedBy: Math Utilities Tests GCD of two zero values should throw error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GCD is undefined for both zero."

Received function did not throw

[Killed] ConditionalExpression
index.js:16:12
     if (a === 0 && b === 0) {
         throw new Error('GCD is undefined for both zero.');
     }
-    return b === 0 ? Math.abs(a) : gcd(b, a % b);
+    return true ? Math.abs(a) : gcd(b, a % b);
 }
 // Function to calculate the nth Fibonacci number.
killedBy: Math Utilities Tests GCD of 28 and 35 should be 7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 28

[Killed] EqualityOperator
index.js:16:12
     if (a === 0 && b === 0) {
         throw new Error('GCD is undefined for both zero.');
     }
-    return b === 0 ? Math.abs(a) : gcd(b, a % b);
+    return b !== 0 ? Math.abs(a) : gcd(b, a % b);
 }
 // Function to calculate the nth Fibonacci number.
killedBy: Math Utilities Tests GCD of 28 and 35 should be 7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 28

[Killed] BlockStatement
index.js:19:23
     return b === 0 ? Math.abs(a) : gcd(b, a % b);
 }
 // Function to calculate the nth Fibonacci number.
-function fibonacci(n) {
-    if (n < 0) throw new Error("Fibonacci is undefined for negative indices.");
-    if (n === 0) return 0;
-    if (n === 1) return 1;
-    let a = 0, b = 1;
-    for (let i = 2; i <= n; i++) {
-        let temp = a + b;
-        a = b;
-        b = temp;
-    }
-    return b;
-}
+function fibonacci(n) {}
 // // Function to check if a number is prime.
 // function isPrime(n) {
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: undefined

[Killed] ConditionalExpression
index.js:20:9
 }
 // Function to calculate the nth Fibonacci number.
 function fibonacci(n) {
-    if (n < 0) throw new Error("Fibonacci is undefined for negative indices.");
+    if (true) throw new Error("Fibonacci is undefined for negative indices.");
     if (n === 0) return 0;
     if (n === 1) return 1;
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: Fibonacci is undefined for negative indices.

[Killed] EqualityOperator
index.js:20:9
 }
 // Function to calculate the nth Fibonacci number.
 function fibonacci(n) {
-    if (n < 0) throw new Error("Fibonacci is undefined for negative indices.");
+    if (n >= 0) throw new Error("Fibonacci is undefined for negative indices.");
     if (n === 0) return 0;
     if (n === 1) return 1;
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: Fibonacci is undefined for negative indices.

[Killed] EqualityOperator
index.js:21:9
 // Function to calculate the nth Fibonacci number.
 function fibonacci(n) {
     if (n < 0) throw new Error("Fibonacci is undefined for negative indices.");
-    if (n === 0) return 0;
+    if (n !== 0) return 0;
     if (n === 1) return 1;
     let a = 0, b = 1;
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 0

[Killed] ConditionalExpression
index.js:21:9
 // Function to calculate the nth Fibonacci number.
 function fibonacci(n) {
     if (n < 0) throw new Error("Fibonacci is undefined for negative indices.");
-    if (n === 0) return 0;
+    if (true) return 0;
     if (n === 1) return 1;
     let a = 0, b = 1;
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 0

[Killed] ConditionalExpression
index.js:22:9
 function fibonacci(n) {
     if (n < 0) throw new Error("Fibonacci is undefined for negative indices.");
     if (n === 0) return 0;
-    if (n === 1) return 1;
+    if (true) return 1;
     let a = 0, b = 1;
     for (let i = 2; i <= n; i++) {
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 1

[Killed] EqualityOperator
index.js:22:9
 function fibonacci(n) {
     if (n < 0) throw new Error("Fibonacci is undefined for negative indices.");
     if (n === 0) return 0;
-    if (n === 1) return 1;
+    if (n !== 1) return 1;
     let a = 0, b = 1;
     for (let i = 2; i <= n; i++) {
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 1

[Killed] BlockStatement
index.js:24:34
     if (n === 0) return 0;
     if (n === 1) return 1;
     let a = 0, b = 1;
-    for (let i = 2; i <= n; i++) {
-        let temp = a + b;
-        a = b;
-        b = temp;
-    }
+    for (let i = 2; i <= n; i++) {}
     return b;
 }
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 1

[Killed] EqualityOperator
index.js:24:21
     if (n === 0) return 0;
     if (n === 1) return 1;
     let a = 0, b = 1;
-    for (let i = 2; i <= n; i++) {
+    for (let i = 2; i < n; i++) {
         let temp = a + b;
         a = b;
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 34

[Killed] ArithmeticOperator
index.js:25:20
     if (n === 1) return 1;
     let a = 0, b = 1;
     for (let i = 2; i <= n; i++) {
-        let temp = a + b;
+        let temp = a - b;
         a = b;
         b = temp;
killedBy: Math Utilities Tests Fibonacci of 10 should be 55
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: -55

[Killed] BlockStatement
index.js:40:27
 //     return true;
 // }
 // Function to calculate the power of a number using recursion.
-function power(base, exp) {
-    if (exp === 0) return 1;
-    if (exp < 0) return 1 / power(base, -exp);
-    return base * power(base, exp - 1);
-}
+function power(base, exp) {}
 // Function to calculate the Least Common Multiple (LCM) of two numbers.
 // Function to calculate LCM of two numbers
killedBy: Math Utilities Tests 2 raised to power 3 should be 8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined

[Killed] ConditionalExpression
index.js:41:9
 // }
 // Function to calculate the power of a number using recursion.
 function power(base, exp) {
-    if (exp === 0) return 1;
+    if (true) return 1;
     if (exp < 0) return 1 / power(base, -exp);
     return base * power(base, exp - 1);
killedBy: Math Utilities Tests 2 raised to power 3 should be 8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 1

[Killed] EqualityOperator
index.js:41:9
 // }
 // Function to calculate the power of a number using recursion.
 function power(base, exp) {
-    if (exp === 0) return 1;
+    if (exp !== 0) return 1;
     if (exp < 0) return 1 / power(base, -exp);
     return base * power(base, exp - 1);
killedBy: Math Utilities Tests 2 raised to power 3 should be 8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 1

[Killed] ArithmeticOperator
index.js:42:25
 // Function to calculate the power of a number using recursion.
 function power(base, exp) {
     if (exp === 0) return 1;
-    if (exp < 0) return 1 / power(base, -exp);
+    if (exp < 0) return 1 * power(base, -exp);
     return base * power(base, exp - 1);
 }
killedBy: Math Utilities Tests 2 raised to power -3 should be 0.125
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.125
Received: 8

[Timeout] UnaryOperator
index.js:42:41
 // Function to calculate the power of a number using recursion.
 function power(base, exp) {
     if (exp === 0) return 1;
-    if (exp < 0) return 1 / power(base, -exp);
+    if (exp < 0) return 1 / power(base, +exp);
     return base * power(base, exp - 1);
 }

[Killed] ArithmeticOperator
index.js:43:12
 function power(base, exp) {
     if (exp === 0) return 1;
     if (exp < 0) return 1 / power(base, -exp);
-    return base * power(base, exp - 1);
+    return base / power(base, exp - 1);
 }
 // Function to calculate the Least Common Multiple (LCM) of two numbers.
killedBy: Math Utilities Tests 2 raised to power 3 should be 8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 2

[Timeout] ArithmeticOperator
index.js:43:31
 function power(base, exp) {
     if (exp === 0) return 1;
     if (exp < 0) return 1 / power(base, -exp);
-    return base * power(base, exp - 1);
+    return base * power(base, exp + 1);
 }
 // Function to calculate the Least Common Multiple (LCM) of two numbers.

[Killed] BlockStatement
index.js:47:20
 }
 // Function to calculate the Least Common Multiple (LCM) of two numbers.
 // Function to calculate LCM of two numbers
-function lcm(a, b) {
-    if (a === 0 || b === 0) return 0; // LCM of 0 and any number is 0
-    return Math.abs(a * b) / gcd(a, b); // LCM formula using GCD
-  }
+function lcm(a, b) {}
 // Function to find all divisors of a number.
 function findDivisors(n) {
killedBy: Math Utilities Tests LCM of 4 and 6 should be 12
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] EqualityOperator
index.js:48:9
 // Function to calculate the Least Common Multiple (LCM) of two numbers.
 // Function to calculate LCM of two numbers
 function lcm(a, b) {
-    if (a === 0 || b === 0) return 0; // LCM of 0 and any number is 0
+    if (a !== 0 || b === 0) return 0; // LCM of 0 and any number is 0
     return Math.abs(a * b) / gcd(a, b); // LCM formula using GCD
   }
killedBy: Math Utilities Tests LCM of 4 and 6 should be 12
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0

[Killed] ConditionalExpression
index.js:48:9
 // Function to calculate the Least Common Multiple (LCM) of two numbers.
 // Function to calculate LCM of two numbers
 function lcm(a, b) {
-    if (a === 0 || b === 0) return 0; // LCM of 0 and any number is 0
+    if (true) return 0; // LCM of 0 and any number is 0
     return Math.abs(a * b) / gcd(a, b); // LCM formula using GCD
   }
killedBy: Math Utilities Tests LCM of 4 and 6 should be 12
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0

[Killed] ArithmeticOperator
index.js:49:21
 // Function to calculate LCM of two numbers
 function lcm(a, b) {
     if (a === 0 || b === 0) return 0; // LCM of 0 and any number is 0
-    return Math.abs(a * b) / gcd(a, b); // LCM formula using GCD
+    return Math.abs(a / b) / gcd(a, b); // LCM formula using GCD
   }
 // Function to find all divisors of a number.
killedBy: Math Utilities Tests LCM of 4 and 6 should be 12
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0.3333333333333333

[Killed] ArithmeticOperator
index.js:49:12
 // Function to calculate LCM of two numbers
 function lcm(a, b) {
     if (a === 0 || b === 0) return 0; // LCM of 0 and any number is 0
-    return Math.abs(a * b) / gcd(a, b); // LCM formula using GCD
+    return Math.abs(a * b) * gcd(a, b); // LCM formula using GCD
   }
 // Function to find all divisors of a number.
killedBy: Math Utilities Tests LCM of 4 and 6 should be 12
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 48

[Killed] BlockStatement
index.js:52:26
     return Math.abs(a * b) / gcd(a, b); // LCM formula using GCD
   }
 // Function to find all divisors of a number.
-function findDivisors(n) {
-    if (n <= 0) {
-        throw new Error("Number must be greater than 0");
-    }
-    let divisors = [];
-    for (let i = 1; i <= Math.sqrt(n); i++) {
-        if (n % i === 0) {
-            divisors.push(i); // Add divisor
-            if (i !== n / i) {
-                divisors.push(n / i); // Add the complement divisor
-            }
-        }
-    }
-    divisors.sort((a, b) => a - b); // Sort the divisors in ascending order
-    return divisors;
-}
+function findDivisors(n) {}
 // Function to check if a number is a perfect number.
 function isPerfectNumber(n) {
killedBy: Integration Mutation Testing - Additional Cases Integration Test: GCD and Divisors with IPEX
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4, 6, 12]
Received: undefined

[Killed] EqualityOperator
index.js:53:9
   }
 // Function to find all divisors of a number.
 function findDivisors(n) {
-    if (n <= 0) {
+    if (n < 0) {
         throw new Error("Number must be greater than 0");
     }
killedBy: Math Utilities Tests Divisors of 0 should throw error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Number must be greater than 0"

Received function did not throw

[Killed] EqualityOperator
index.js:53:9
   }
 // Function to find all divisors of a number.
 function findDivisors(n) {
-    if (n <= 0) {
+    if (n > 0) {
         throw new Error("Number must be greater than 0");
     }
killedBy: Math Utilities Tests Divisors of 28 should be [1, 2, 4, 7, 14, 28]
statusReason: Error: Number must be greater than 0

[Killed] ArrayDeclaration
index.js:56:20
     if (n <= 0) {
         throw new Error("Number must be greater than 0");
     }
-    let divisors = [];
+    let divisors = ["Stryker was here"];
     for (let i = 1; i <= Math.sqrt(n); i++) {
         if (n % i === 0) {
killedBy: Integration Mutation Testing - Additional Cases Integration Test: GCD and Divisors with IPEX
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

@@ -1,6 +1,7 @@
  Array [
+   "Stryker was here",

[Killed] EqualityOperator
index.js:57:21
         throw new Error("Number must be greater than 0");
     }
     let divisors = [];
-    for (let i = 1; i <= Math.sqrt(n); i++) {
+    for (let i = 1; i < Math.sqrt(n); i++) {
         if (n % i === 0) {
             divisors.push(i); // Add divisor
killedBy: Math Utilities Tests Divisors of 1 should be [1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] ConditionalExpression
index.js:57:21
         throw new Error("Number must be greater than 0");
     }
     let divisors = [];
-    for (let i = 1; i <= Math.sqrt(n); i++) {
+    for (let i = 1; false; i++) {
         if (n % i === 0) {
             divisors.push(i); // Add divisor
killedBy: Math Utilities Tests Divisors of 28 should be [1, 2, 4, 7, 14, 28]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] ConditionalExpression
index.js:58:13
     }
     let divisors = [];
     for (let i = 1; i <= Math.sqrt(n); i++) {
-        if (n % i === 0) {
+        if (true) {
             divisors.push(i); // Add divisor
             if (i !== n / i) {
killedBy: Integration Mutation Testing - Additional Cases Integration Test: Fibonacci and Divisors Relationship
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

  Array [
    1,
+   2,

[Killed] ConditionalExpression
index.js:58:13
     }
     let divisors = [];
     for (let i = 1; i <= Math.sqrt(n); i++) {
-        if (n % i === 0) {
+        if (false) {
             divisors.push(i); // Add divisor
             if (i !== n / i) {
killedBy: Integration Mutation Testing - Additional Cases Integration Test: GCD and Divisors with IPEX
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] EqualityOperator
index.js:60:17
     for (let i = 1; i <= Math.sqrt(n); i++) {
         if (n % i === 0) {
             divisors.push(i); // Add divisor
-            if (i !== n / i) {
+            if (i === n / i) {
                 divisors.push(n / i); // Add the complement divisor
             }
killedBy: Math Utilities Tests Divisors of 28 should be [1, 2, 4, 7, 14, 28]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    1,
    2,

[Killed] BlockStatement
index.js:60:30
     for (let i = 1; i <= Math.sqrt(n); i++) {
         if (n % i === 0) {
             divisors.push(i); // Add divisor
-            if (i !== n / i) {
-                divisors.push(n / i); // Add the complement divisor
-            }
+            if (i !== n / i) {}
         }
     }
killedBy: Math Utilities Tests Divisors of 28 should be [1, 2, 4, 7, 14, 28]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    1,
    2,

[Killed] ArithmeticOperator
index.js:61:31
         if (n % i === 0) {
             divisors.push(i); // Add divisor
             if (i !== n / i) {
-                divisors.push(n / i); // Add the complement divisor
+                divisors.push(n * i); // Add the complement divisor
             }
         }
killedBy: Math Utilities Tests Divisors of 28 should be [1, 2, 4, 7, 14, 28]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    1,
    2,

[Killed] MethodExpression
index.js:65:5
             }
         }
     }
-    divisors.sort((a, b) => a - b); // Sort the divisors in ascending order
+    divisors; // Sort the divisors in ascending order
     return divisors;
 }
killedBy: Math Utilities Tests Divisors of 28 should be [1, 2, 4, 7, 14, 28]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    1,
+   28,

[Killed] ArrowFunction
index.js:65:19
             }
         }
     }
-    divisors.sort((a, b) => a - b); // Sort the divisors in ascending order
+    divisors.sort(() => undefined); // Sort the divisors in ascending order
     return divisors;
 }
killedBy: Math Utilities Tests Divisors of 28 should be [1, 2, 4, 7, 14, 28]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    1,
+   28,

[Killed] BlockStatement
index.js:69:29
     return divisors;
 }
 // Function to check if a number is a perfect number.
-function isPerfectNumber(n) {
-    if (n <= 1) return false;
-    let sum = 1;
-    for (let i = 2; i <= Math.sqrt(n); i++) {
-        if (n % i === 0) {
-            sum += i;
-            if (i !== n / i) sum += n / i;
-        }
-    }
-    return sum === n;
-}
+function isPerfectNumber(n) {}
 // Function to find the largest prime factor of a number.
 function largestPrimeFactor(n) {
killedBy: Integration Mutation Testing - Additional Cases Integration Test: Perfect Number Validation IMCD
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
index.js:70:9
 }
 // Function to check if a number is a perfect number.
 function isPerfectNumber(n) {
-    if (n <= 1) return false;
+    if (true) return false;
     let sum = 1;
     for (let i = 2; i <= Math.sqrt(n); i++) {
killedBy: Integration Mutation Testing - Additional Cases Integration Test: Perfect Number Validation IMCD
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
index.js:70:9
 }
 // Function to check if a number is a perfect number.
 function isPerfectNumber(n) {
-    if (n <= 1) return false;
+    if (n > 1) return false;
     let sum = 1;
     for (let i = 2; i <= Math.sqrt(n); i++) {
killedBy: Math Utilities Tests 6 is a perfect number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
index.js:72:45
 function isPerfectNumber(n) {
     if (n <= 1) return false;
     let sum = 1;
-    for (let i = 2; i <= Math.sqrt(n); i++) {
-        if (n % i === 0) {
-            sum += i;
-            if (i !== n / i) sum += n / i;
-        }
-    }
+    for (let i = 2; i <= Math.sqrt(n); i++) {}
     return sum === n;
 }
killedBy: Math Utilities Tests 6 is a perfect number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
index.js:72:21
 function isPerfectNumber(n) {
     if (n <= 1) return false;
     let sum = 1;
-    for (let i = 2; i <= Math.sqrt(n); i++) {
+    for (let i = 2; false; i++) {
         if (n % i === 0) {
             sum += i;
killedBy: Integration Mutation Testing - Additional Cases Integration Test: Perfect Number Validation IMCD
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
index.js:73:13
     if (n <= 1) return false;
     let sum = 1;
     for (let i = 2; i <= Math.sqrt(n); i++) {
-        if (n % i === 0) {
+        if (true) {
             sum += i;
             if (i !== n / i) sum += n / i;
killedBy: Math Utilities Tests 28 is a perfect number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
index.js:73:13
     if (n <= 1) return false;
     let sum = 1;
     for (let i = 2; i <= Math.sqrt(n); i++) {
-        if (n % i === 0) {
+        if (false) {
             sum += i;
             if (i !== n / i) sum += n / i;
killedBy: Integration Mutation Testing - Additional Cases Integration Test: Perfect Number Validation IMCD
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] AssignmentOperator
index.js:74:13
     let sum = 1;
     for (let i = 2; i <= Math.sqrt(n); i++) {
         if (n % i === 0) {
-            sum += i;
+            sum -= i;
             if (i !== n / i) sum += n / i;
         }
killedBy: Math Utilities Tests 6 is a perfect number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
index.js:75:37
     for (let i = 2; i <= Math.sqrt(n); i++) {
         if (n % i === 0) {
             sum += i;
-            if (i !== n / i) sum += n / i;
+            if (i !== n / i) sum += n * i;
         }
     }
killedBy: Integration Mutation Testing - Additional Cases Integration Test: Perfect Number Validation IMCD
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] AssignmentOperator
index.js:75:30
     for (let i = 2; i <= Math.sqrt(n); i++) {
         if (n % i === 0) {
             sum += i;
-            if (i !== n / i) sum += n / i;
+            if (i !== n / i) sum -= n / i;
         }
     }
killedBy: Integration Mutation Testing - Additional Cases Integration Test: Perfect Number Validation IMCD
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
index.js:78:12
             if (i !== n / i) sum += n / i;
         }
     }
-    return sum === n;
+    return sum !== n;
 }
 // Function to find the largest prime factor of a number.
killedBy: Math Utilities Tests 6 is a perfect number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
index.js:78:12
             if (i !== n / i) sum += n / i;
         }
     }
-    return sum === n;
+    return true;
 }
 // Function to find the largest prime factor of a number.
killedBy: Math Utilities Tests 7 is not a perfect number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
index.js:81:32
     return sum === n;
 }
 // Function to find the largest prime factor of a number.
-function largestPrimeFactor(n) {
-    if (n < 2) {
-        throw new Error('Number must be greater than 1.');
-    }
-    let factor = 2;
-    while (factor <= Math.sqrt(n)) {
-        if (n % factor === 0) {
-            n /= factor;
-        } else {
-            factor++;
-        }
-    }
-    return n;
-}
+function largestPrimeFactor(n) {}
 // // Function to find the prime factors of a number.
 // function primeFactorization(n) {
killedBy: Math Utilities Tests Largest prime factor of 60 should be 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
index.js:82:16
 }
 // Function to find the largest prime factor of a number.
 function largestPrimeFactor(n) {
-    if (n < 2) {
-        throw new Error('Number must be greater than 1.');
-    }
+    if (n < 2) {}
     let factor = 2;
     while (factor <= Math.sqrt(n)) {
killedBy: Math Utilities Tests Largest prime factor of 1 should throw error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Number must be greater than 1."

Received function did not throw

[Killed] ConditionalExpression
index.js:82:9
 }
 // Function to find the largest prime factor of a number.
 function largestPrimeFactor(n) {
-    if (n < 2) {
+    if (false) {
         throw new Error('Number must be greater than 1.');
     }
killedBy: Math Utilities Tests Largest prime factor of 1 should throw error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Number must be greater than 1."

Received function did not throw
