[Killed] EqualityOperator
index.js:86:12
         throw new Error('Number must be greater than 1.');
     }
     let factor = 2;
-    while (factor <= Math.sqrt(n)) {
+    while (factor > Math.sqrt(n)) {
         if (n % factor === 0) {
             n /= factor;
killedBy: Math Utilities Tests Largest prime factor of 60 should be 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 60

[Killed] ConditionalExpression
index.js:86:12
         throw new Error('Number must be greater than 1.');
     }
     let factor = 2;
-    while (factor <= Math.sqrt(n)) {
+    while (false) {
         if (n % factor === 0) {
             n /= factor;
killedBy: Math Utilities Tests Largest prime factor of 60 should be 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 60

[Killed] ConditionalExpression
index.js:87:13
     }
     let factor = 2;
     while (factor <= Math.sqrt(n)) {
-        if (n % factor === 0) {
+        if (true) {
             n /= factor;
         } else {
killedBy: Math Utilities Tests Largest prime factor of 60 should be 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 3.75

[Killed] ArithmeticOperator
index.js:87:13
     }
     let factor = 2;
     while (factor <= Math.sqrt(n)) {
-        if (n % factor === 0) {
+        if (n * factor === 0) {
             n /= factor;
         } else {
killedBy: Math Utilities Tests Largest prime factor of 60 should be 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 60

[Timeout] AssignmentOperator
index.js:88:13
     let factor = 2;
     while (factor <= Math.sqrt(n)) {
         if (n % factor === 0) {
-            n /= factor;
+            n *= factor;
         } else {
             factor++;

[Timeout] BlockStatement
index.js:89:16
     while (factor <= Math.sqrt(n)) {
         if (n % factor === 0) {
             n /= factor;
-        } else {
-            factor++;
-        }
+        } else {}
     }
     return n;

[Timeout] UpdateOperator
index.js:90:13
         if (n % factor === 0) {
             n /= factor;
         } else {
-            factor++;
+            factor--;
         }
     }

[Killed] BlockStatement
index.js:109:37
 //     return factors;
 // }
 // Function to generate all prime numbers up to a given limit using the Sieve of Eratosthenes.
-function sieveOfEratosthenes(limit) {
-    let isPrime = new Array(limit + 1).fill(true);
-    isPrime[0] = isPrime[1] = false;
-    for (let i = 2; i * i <= limit; i++) {
-        if (isPrime[i]) {
-            for (let j = i * i; j <= limit; j += i) {
-                isPrime[j] = false;
-            }
-        }
-    }
-    return Array.from({ length: limit - 1 }, (_, i) => i + 2).filter(i => isPrime[i]);
-}
+function sieveOfEratosthenes(limit) {}
 //Check Armstrong Number
 function isArmstrongNumber(num) {
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
Received: undefined

[Killed] ArithmeticOperator
index.js:110:29
 // }
 // Function to generate all prime numbers up to a given limit using the Sieve of Eratosthenes.
 function sieveOfEratosthenes(limit) {
-    let isPrime = new Array(limit + 1).fill(true);
+    let isPrime = new Array(limit - 1).fill(true);
     isPrime[0] = isPrime[1] = false;
     for (let i = 2; i * i <= limit; i++) {
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -6,7 +6,6 @@
    11,
    13,

[Killed] BooleanLiteral
index.js:110:45
 // }
 // Function to generate all prime numbers up to a given limit using the Sieve of Eratosthenes.
 function sieveOfEratosthenes(limit) {
-    let isPrime = new Array(limit + 1).fill(true);
+    let isPrime = new Array(limit + 1).fill(false);
     isPrime[0] = isPrime[1] = false;
     for (let i = 2; i * i <= limit; i++) {
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

- Array [
-   2,
-   3,

[Survived] BooleanLiteral
index.js:111:31
 // Function to generate all prime numbers up to a given limit using the Sieve of Eratosthenes.
 function sieveOfEratosthenes(limit) {
     let isPrime = new Array(limit + 1).fill(true);
-    isPrime[0] = isPrime[1] = false;
+    isPrime[0] = isPrime[1] = true;
     for (let i = 2; i * i <= limit; i++) {
         if (isPrime[i]) {

[Killed] ConditionalExpression
index.js:112:21
 function sieveOfEratosthenes(limit) {
     let isPrime = new Array(limit + 1).fill(true);
     isPrime[0] = isPrime[1] = false;
-    for (let i = 2; i * i <= limit; i++) {
+    for (let i = 2; false; i++) {
         if (isPrime[i]) {
             for (let j = i * i; j <= limit; j += i) {
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 19

  Array [
    2,
    3,

[Killed] UpdateOperator
index.js:112:37
 function sieveOfEratosthenes(limit) {
     let isPrime = new Array(limit + 1).fill(true);
     isPrime[0] = isPrime[1] = false;
-    for (let i = 2; i * i <= limit; i++) {
+    for (let i = 2; i * i <= limit; i--) {
         if (isPrime[i]) {
             for (let j = i * i; j <= limit; j += i) {
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

  Array [
    2,
    3,

[Killed] BlockStatement
index.js:113:25
     let isPrime = new Array(limit + 1).fill(true);
     isPrime[0] = isPrime[1] = false;
     for (let i = 2; i * i <= limit; i++) {
-        if (isPrime[i]) {
-            for (let j = i * i; j <= limit; j += i) {
-                isPrime[j] = false;
-            }
-        }
+        if (isPrime[i]) {}
     }
     return Array.from({ length: limit - 1 }, (_, i) => i + 2).filter(i => isPrime[i]);
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 19

  Array [
    2,
    3,

[Killed] ConditionalExpression
index.js:113:13
     let isPrime = new Array(limit + 1).fill(true);
     isPrime[0] = isPrime[1] = false;
     for (let i = 2; i * i <= limit; i++) {
-        if (isPrime[i]) {
+        if (false) {
             for (let j = i * i; j <= limit; j += i) {
                 isPrime[j] = false;
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 19

  Array [
    2,
    3,

[Killed] EqualityOperator
index.js:114:33
     isPrime[0] = isPrime[1] = false;
     for (let i = 2; i * i <= limit; i++) {
         if (isPrime[i]) {
-            for (let j = i * i; j <= limit; j += i) {
+            for (let j = i * i; j < limit; j += i) {
                 isPrime[j] = false;
             }
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

@@ -7,6 +7,7 @@
    13,
    17,

[Killed] ArithmeticOperator
index.js:114:26
     isPrime[0] = isPrime[1] = false;
     for (let i = 2; i * i <= limit; i++) {
         if (isPrime[i]) {
-            for (let j = i * i; j <= limit; j += i) {
+            for (let j = i / i; j <= limit; j += i) {
                 isPrime[j] = false;
             }
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  9
+ Received  + 14

  Array [
    2,
-   3,

[Killed] BooleanLiteral
index.js:115:30
     for (let i = 2; i * i <= limit; i++) {
         if (isPrime[i]) {
             for (let j = i * i; j <= limit; j += i) {
-                isPrime[j] = false;
+                isPrime[j] = true;
             }
         }
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 19

  Array [
    2,
    3,

[Killed] MethodExpression
index.js:119:12
             }
         }
     }
-    return Array.from({ length: limit - 1 }, (_, i) => i + 2).filter(i => isPrime[i]);
+    return Array.from({
+  length: limit - 1
+}, (_, i) => i + 2);
 }
 //Check Armstrong Number
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 19

  Array [
    2,
    3,

[Killed] ArithmeticOperator
index.js:119:56
             }
         }
     }
-    return Array.from({ length: limit - 1 }, (_, i) => i + 2).filter(i => isPrime[i]);
+    return Array.from({ length: limit - 1 }, (_, i) => i - 2).filter(i => isPrime[i]);
 }
 //Check Armstrong Number
killedBy: Math Utilities Tests Primes up to 30 should be [2, 3, 5, 7, 11, 13, 17, 19, 23, 29]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -6,7 +6,6 @@
    11,
    13,

[Killed] BlockStatement
index.js:122:33
     return Array.from({ length: limit - 1 }, (_, i) => i + 2).filter(i => isPrime[i]);
 }
 //Check Armstrong Number
-function isArmstrongNumber(num) {
-    const digits = num.toString().split('').map(Number);
-    return digits.reduce((sum, d) => sum + Math.pow(d, digits.length), 0) === num;
-}
+function isArmstrongNumber(num) {}
 // DSA FUNCTIONS ---------------------------------------
 //Bubble sort
killedBy: Math Utilities Tests 153 is an Armstrong number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
index.js:124:12
 //Check Armstrong Number
 function isArmstrongNumber(num) {
     const digits = num.toString().split('').map(Number);
-    return digits.reduce((sum, d) => sum + Math.pow(d, digits.length), 0) === num;
+    return false;
 }
 // DSA FUNCTIONS ---------------------------------------
killedBy: Math Utilities Tests 153 is an Armstrong number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
index.js:124:12
 //Check Armstrong Number
 function isArmstrongNumber(num) {
     const digits = num.toString().split('').map(Number);
-    return digits.reduce((sum, d) => sum + Math.pow(d, digits.length), 0) === num;
+    return true;
 }
 // DSA FUNCTIONS ---------------------------------------
killedBy: Math Utilities Tests 123 is not an Armstrong number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
index.js:128:26
 }
 // DSA FUNCTIONS ---------------------------------------
 //Bubble sort
-function bubbleSort(arr) {
-    let n = arr.length;
-    for (let i = 0; i < n - 1; i++) {
-        for (let j = 0; j < n - i - 1; j++) {
-            if (arr[j] > arr[j + 1]) {
-                [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
-            }
-        }
-    }
-    return arr;
-}
+function bubbleSort(arr) {}
 //Max in Array
 function findMax(arr) {
killedBy: DSA Functions Tests Bubble sort of [4, 2, 3, 1] should return [1, 2, 3, 4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4]
Received: undefined

[Killed] BlockStatement
index.js:130:37
 //Bubble sort
 function bubbleSort(arr) {
     let n = arr.length;
-    for (let i = 0; i < n - 1; i++) {
-        for (let j = 0; j < n - i - 1; j++) {
-            if (arr[j] > arr[j + 1]) {
-                [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
-            }
-        }
-    }
+    for (let i = 0; i < n - 1; i++) {}
     return arr;
 }
killedBy: DSA Functions Tests Bubble sort of [4, 2, 3, 1] should return [1, 2, 3, 4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
+   4,

[Killed] ConditionalExpression
index.js:130:21
 //Bubble sort
 function bubbleSort(arr) {
     let n = arr.length;
-    for (let i = 0; i < n - 1; i++) {
+    for (let i = 0; false; i++) {
         for (let j = 0; j < n - i - 1; j++) {
             if (arr[j] > arr[j + 1]) {
killedBy: DSA Functions Tests Bubble sort of [4, 2, 3, 1] should return [1, 2, 3, 4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
+   4,

[Killed] BlockStatement
index.js:131:45
 function bubbleSort(arr) {
     let n = arr.length;
     for (let i = 0; i < n - 1; i++) {
-        for (let j = 0; j < n - i - 1; j++) {
-            if (arr[j] > arr[j + 1]) {
-                [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
-            }
-        }
+        for (let j = 0; j < n - i - 1; j++) {}
     }
     return arr;
killedBy: DSA Functions Tests Bubble sort of [4, 2, 3, 1] should return [1, 2, 3, 4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
+   4,

[Killed] EqualityOperator
index.js:131:25
 function bubbleSort(arr) {
     let n = arr.length;
     for (let i = 0; i < n - 1; i++) {
-        for (let j = 0; j < n - i - 1; j++) {
+        for (let j = 0; j >= n - i - 1; j++) {
             if (arr[j] > arr[j + 1]) {
                 [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
killedBy: Integration Mutation Testing - Additional Cases Integration Test: Bubble Sort IREM with odd-sized array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   11,
-   22,

[Killed] ArithmeticOperator
index.js:132:30
     let n = arr.length;
     for (let i = 0; i < n - 1; i++) {
         for (let j = 0; j < n - i - 1; j++) {
-            if (arr[j] > arr[j + 1]) {
+            if (arr[j] > arr[j - 1]) {
                 [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
             }
killedBy: DSA Functions Tests Bubble sort of [4, 2, 3, 1] should return [1, 2, 3, 4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
+   4,

[Killed] ConditionalExpression
index.js:132:17
     let n = arr.length;
     for (let i = 0; i < n - 1; i++) {
         for (let j = 0; j < n - i - 1; j++) {
-            if (arr[j] > arr[j + 1]) {
+            if (false) {
                 [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
             }
killedBy: DSA Functions Tests Bubble sort of [4, 2, 3, 1] should return [1, 2, 3, 4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
+   4,

[Killed] ArithmeticOperator
index.js:133:30
     for (let i = 0; i < n - 1; i++) {
         for (let j = 0; j < n - i - 1; j++) {
             if (arr[j] > arr[j + 1]) {
-                [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
+                [arr[j], arr[j - 1]] = [arr[j + 1], arr[j]];
             }
         }
killedBy: DSA Functions Tests Bubble sort of [4, 2, 3, 1] should return [1, 2, 3, 4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    1,
-   2,

[Killed] ArithmeticOperator
index.js:133:45
     for (let i = 0; i < n - 1; i++) {
         for (let j = 0; j < n - i - 1; j++) {
             if (arr[j] > arr[j + 1]) {
-                [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
+                [arr[j], arr[j + 1]] = [arr[j - 1], arr[j]];
             }
         }
killedBy: DSA Functions Tests Bubble sort of [4, 2, 3, 1] should return [1, 2, 3, 4]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] BlockStatement
index.js:140:23
     return arr;
 }
 //Max in Array
-function findMax(arr) {
-    if (arr.length === 0) throw new Error("Array must not be empty");
-    return Math.max(...arr);
-}
+function findMax(arr) {}
 //Reverse a String
 function reverseString(str) {
killedBy: DSA Functions Tests Maximum element in [1, 2, 3, 4, 5] should be 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
index.js:141:9
 }
 //Max in Array
 function findMax(arr) {
-    if (arr.length === 0) throw new Error("Array must not be empty");
+    if (true) throw new Error("Array must not be empty");
     return Math.max(...arr);
 }
killedBy: DSA Functions Tests Maximum element in [1, 2, 3, 4, 5] should be 5
statusReason: Error: Array must not be empty

[Killed] EqualityOperator
index.js:141:9
 }
 //Max in Array
 function findMax(arr) {
-    if (arr.length === 0) throw new Error("Array must not be empty");
+    if (arr.length !== 0) throw new Error("Array must not be empty");
     return Math.max(...arr);
 }
killedBy: DSA Functions Tests Maximum element in [1, 2, 3, 4, 5] should be 5
statusReason: Error: Array must not be empty

[Killed] MethodExpression
index.js:142:12
 //Max in Array
 function findMax(arr) {
     if (arr.length === 0) throw new Error("Array must not be empty");
-    return Math.max(...arr);
+    return Math.min(...arr);
 }
 //Reverse a String
killedBy: DSA Functions Tests Maximum element in [1, 2, 3, 4, 5] should be 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] BlockStatement
index.js:145:29
     return Math.max(...arr);
 }
 //Reverse a String
-function reverseString(str) {
-    return str.split('').reverse().join('');
-}
+function reverseString(str) {}
 //Palindrome Check
 function isPalindrome(str) {
killedBy: DSA Functions Tests Reverse of "hello" should be "olleh"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "olleh"
Received: undefined

[Killed] MethodExpression
index.js:146:12
 }
 //Reverse a String
 function reverseString(str) {
-    return str.split('').reverse().join('');
+    return str.split('').join('');
 }
 //Palindrome Check
killedBy: DSA Functions Tests Reverse of "hello" should be "olleh"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "olleh"
Received: "hello"

[Killed] StringLiteral
index.js:146:41
 }
 //Reverse a String
 function reverseString(str) {
-    return str.split('').reverse().join('');
+    return str.split('').reverse().join("Stryker was here!");
 }
 //Palindrome Check
killedBy: DSA Functions Tests Reverse of "hello" should be "olleh"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "olleh"
Received: "oStryker was here!lStryker was here!lStryker was here!eStryker was here!h"

[Killed] BlockStatement
index.js:149:28
     return str.split('').reverse().join('');
 }
 //Palindrome Check
-function isPalindrome(str) {
-    const sanitized = str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase();
-    return sanitized === sanitized.split('').reverse().join('');
-}
+function isPalindrome(str) {}
 //Anagram Check
 function areAnagrams(str1, str2) {
killedBy: DSA Functions Tests isPalindrome - Racecar is a palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Survived] MethodExpression
index.js:150:23
 }
 //Palindrome Check
 function isPalindrome(str) {
-    const sanitized = str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase();
+    const sanitized = str.replace(/[^a-zA-Z0-9]/g, '').toUpperCase();
     return sanitized === sanitized.split('').reverse().join('');
 }

[Killed] EqualityOperator
index.js:151:12
 //Palindrome Check
 function isPalindrome(str) {
     const sanitized = str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase();
-    return sanitized === sanitized.split('').reverse().join('');
+    return sanitized !== sanitized.split('').reverse().join('');
 }
 //Anagram Check
killedBy: DSA Functions Tests isPalindrome - Racecar is a palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
index.js:151:26
 //Palindrome Check
 function isPalindrome(str) {
     const sanitized = str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase();
-    return sanitized === sanitized.split('').reverse().join('');
+    return sanitized === sanitized.split('').join('');
 }
 //Anagram Check
killedBy: DSA Functions Tests isPalindrome - Hello is not a palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
index.js:154:34
     return sanitized === sanitized.split('').reverse().join('');
 }
 //Anagram Check
-function areAnagrams(str1, str2) {
-    const normalize = str => str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase().split('').sort().join('');
-    return normalize(str1) === normalize(str2);
-}
+function areAnagrams(str1, str2) {}
 // Binary Search Algorithm.
 function binarySearch(arr, target) {
killedBy: DSA Functions Tests "listen" and "silent" are anagrams
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrowFunction
index.js:155:23
 }
 //Anagram Check
 function areAnagrams(str1, str2) {
-    const normalize = str => str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase().split('').sort().join('');
+    const normalize = () => undefined;
     return normalize(str1) === normalize(str2);
 }
killedBy: DSA Functions Tests "apple" and "pale" are not anagrams
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
index.js:155:30
 }
 //Anagram Check
 function areAnagrams(str1, str2) {
-    const normalize = str => str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase().split('').sort().join('');
+    const normalize = str => str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase().split('').join('');
     return normalize(str1) === normalize(str2);
 }
killedBy: DSA Functions Tests "listen" and "silent" are anagrams
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
index.js:156:12
 //Anagram Check
 function areAnagrams(str1, str2) {
     const normalize = str => str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase().split('').sort().join('');
-    return normalize(str1) === normalize(str2);
+    return false;
 }
 // Binary Search Algorithm.
killedBy: DSA Functions Tests "listen" and "silent" are anagrams
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
index.js:156:12
 //Anagram Check
 function areAnagrams(str1, str2) {
     const normalize = str => str.replace(/[^a-zA-Z0-9]/g, '').toLowerCase().split('').sort().join('');
-    return normalize(str1) === normalize(str2);
+    return normalize(str1) !== normalize(str2);
 }
 // Binary Search Algorithm.
killedBy: DSA Functions Tests "listen" and "silent" are anagrams
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
index.js:159:36
     return normalize(str1) === normalize(str2);
 }
 // Binary Search Algorithm.
-function binarySearch(arr, target) {
-    let left = 0, right = arr.length - 1;
-    while (left <= right) {
-        let mid = left + Math.floor((right - left) / 2);
-        if (arr[mid] === target) return mid;
-        else if (arr[mid] < target) left = mid + 1;
-        else right = mid - 1;
-    }
-    return -1;
-}
+function binarySearch(arr, target) {}
 //Knapsack Problem
 function knapsack(weights, values, capacity) {
killedBy: DSA Functions Tests Index of 5 in array [1, 3, 5, 7, 9] should be 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Survived] ArithmeticOperator
index.js:160:27
 }
 // Binary Search Algorithm.
 function binarySearch(arr, target) {
-    let left = 0, right = arr.length - 1;
+    let left = 0, right = arr.length + 1;
     while (left <= right) {
         let mid = left + Math.floor((right - left) / 2);

[Killed] EqualityOperator
index.js:161:12
 // Binary Search Algorithm.
 function binarySearch(arr, target) {
     let left = 0, right = arr.length - 1;
-    while (left <= right) {
+    while (left < right) {
         let mid = left + Math.floor((right - left) / 2);
         if (arr[mid] === target) return mid;
killedBy: DSA Functions Tests Binary search on large array should return correct index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 999
Received: -1

[Killed] ConditionalExpression
index.js:161:12
 // Binary Search Algorithm.
 function binarySearch(arr, target) {
     let left = 0, right = arr.length - 1;
-    while (left <= right) {
+    while (false) {
         let mid = left + Math.floor((right - left) / 2);
         if (arr[mid] === target) return mid;
killedBy: DSA Functions Tests Index of 5 in array [1, 3, 5, 7, 9] should be 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ArithmeticOperator
index.js:162:19
 function binarySearch(arr, target) {
     let left = 0, right = arr.length - 1;
     while (left <= right) {
-        let mid = left + Math.floor((right - left) / 2);
+        let mid = left - Math.floor((right - left) / 2);
         if (arr[mid] === target) return mid;
         else if (arr[mid] < target) left = mid + 1;
killedBy: DSA Functions Tests Index of 5 in array [1, 3, 5, 7, 9] should be 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Timeout] ArithmeticOperator
index.js:162:38
 function binarySearch(arr, target) {
     let left = 0, right = arr.length - 1;
     while (left <= right) {
-        let mid = left + Math.floor((right - left) / 2);
+        let mid = left + Math.floor((right + left) / 2);
         if (arr[mid] === target) return mid;
         else if (arr[mid] < target) left = mid + 1;

[Killed] ConditionalExpression
index.js:163:13
     let left = 0, right = arr.length - 1;
     while (left <= right) {
         let mid = left + Math.floor((right - left) / 2);
-        if (arr[mid] === target) return mid;
+        if (true) return mid;
         else if (arr[mid] < target) left = mid + 1;
         else right = mid - 1;
killedBy: DSA Functions Tests Index of 10 in array [1, 3, 5, 7, 9] should be -1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 2

[Killed] EqualityOperator
index.js:163:13
     let left = 0, right = arr.length - 1;
     while (left <= right) {
         let mid = left + Math.floor((right - left) / 2);
-        if (arr[mid] === target) return mid;
+        if (arr[mid] !== target) return mid;
         else if (arr[mid] < target) left = mid + 1;
         else right = mid - 1;
killedBy: DSA Functions Tests Index of 5 in array [1, 3, 5, 7, 9] should be 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
index.js:164:18
     while (left <= right) {
         let mid = left + Math.floor((right - left) / 2);
         if (arr[mid] === target) return mid;
-        else if (arr[mid] < target) left = mid + 1;
+        else if (arr[mid] >= target) left = mid + 1;
         else right = mid - 1;
     }
killedBy: DSA Functions Tests Binary search on large array should return correct index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 999
Received: -1

[Killed] BlockStatement
index.js:170:46
     return -1;
 }
 //Knapsack Problem
-function knapsack(weights, values, capacity) {
-    const n = weights.length;
-    const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
-    for (let i = 1; i <= n; i++) {
-        for (let w = 1; w <= capacity; w++) {
-            if (weights[i - 1] <= w) {
-                dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w - weights[i - 1]]);
-            } else {
-                dp[i][w] = dp[i - 1][w];
-            }
-        }
-    }
-    return dp[n][capacity];
-}
+function knapsack(weights, values, capacity) {}
 //BFS Traversal
 function bfs(graph, startNode) {
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: undefined

[Killed] ArithmeticOperator
index.js:172:53
 //Knapsack Problem
 function knapsack(weights, values, capacity) {
     const n = weights.length;
-    const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
+    const dp = Array(n + 1).fill(0).map(() => Array(capacity - 1).fill(0));
     for (let i = 1; i <= n; i++) {
         for (let w = 1; w <= capacity; w++) {
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: NaN
