[Killed] ArithmeticOperator
index.js:172:22
 //Knapsack Problem
 function knapsack(weights, values, capacity) {
     const n = weights.length;
-    const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
+    const dp = Array(n - 1).fill(0).map(() => Array(capacity + 1).fill(0));
     for (let i = 1; i <= n; i++) {
         for (let w = 1; w <= capacity; w++) {
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: TypeError: Cannot set properties of undefined (setting '1')

[Killed] ConditionalExpression
index.js:173:21
 function knapsack(weights, values, capacity) {
     const n = weights.length;
     const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; false; i++) {
         for (let w = 1; w <= capacity; w++) {
             if (weights[i - 1] <= w) {
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 0

[Killed] EqualityOperator
index.js:173:21
 function knapsack(weights, values, capacity) {
     const n = weights.length;
     const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i < n; i++) {
         for (let w = 1; w <= capacity; w++) {
             if (weights[i - 1] <= w) {
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 0

[Killed] EqualityOperator
index.js:174:25
     const n = weights.length;
     const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
     for (let i = 1; i <= n; i++) {
-        for (let w = 1; w <= capacity; w++) {
+        for (let w = 1; w > capacity; w++) {
             if (weights[i - 1] <= w) {
                 dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w - weights[i - 1]]);
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 0

[Killed] ConditionalExpression
index.js:174:25
     const n = weights.length;
     const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
     for (let i = 1; i <= n; i++) {
-        for (let w = 1; w <= capacity; w++) {
+        for (let w = 1; false; w++) {
             if (weights[i - 1] <= w) {
                 dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w - weights[i - 1]]);
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 0

[Killed] ConditionalExpression
index.js:175:17
     const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
     for (let i = 1; i <= n; i++) {
         for (let w = 1; w <= capacity; w++) {
-            if (weights[i - 1] <= w) {
+            if (true) {
                 dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w - weights[i - 1]]);
             } else {
killedBy: DSA Functions Tests Knapsack: no items fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] EqualityOperator
index.js:175:17
     const dp = Array(n + 1).fill(0).map(() => Array(capacity + 1).fill(0));
     for (let i = 1; i <= n; i++) {
         for (let w = 1; w <= capacity; w++) {
-            if (weights[i - 1] <= w) {
+            if (weights[i - 1] < w) {
                 dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w - weights[i - 1]]);
             } else {
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 50

[Killed] ArithmeticOperator
index.js:176:77
     for (let i = 1; i <= n; i++) {
         for (let w = 1; w <= capacity; w++) {
             if (weights[i - 1] <= w) {
-                dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w - weights[i - 1]]);
+                dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w + weights[i - 1]]);
             } else {
                 dp[i][w] = dp[i - 1][w];
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: NaN

[Killed] ArithmeticOperator
index.js:176:58
     for (let i = 1; i <= n; i++) {
         for (let w = 1; w <= capacity; w++) {
             if (weights[i - 1] <= w) {
-                dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w - weights[i - 1]]);
+                dp[i][w] = Math.max(dp[i - 1][w], values[i + 1] + dp[i - 1][w - weights[i - 1]]);
             } else {
                 dp[i][w] = dp[i - 1][w];
killedBy: DSA Functions Tests Knapsack: exact fit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: NaN

[Survived] BlockStatement
index.js:177:20
         for (let w = 1; w <= capacity; w++) {
             if (weights[i - 1] <= w) {
                 dp[i][w] = Math.max(dp[i - 1][w], values[i - 1] + dp[i - 1][w - weights[i - 1]]);
-            } else {
-                dp[i][w] = dp[i - 1][w];
-            }
+            } else {}
         }
     }

[Killed] BlockStatement
index.js:185:32
     return dp[n][capacity];
 }
 //BFS Traversal
-function bfs(graph, startNode) {
-    const visited = new Set();
-    const queue = [startNode];
-    const result = [];
-    while (queue.length > 0) {
-        const node = queue.shift();
-        if (!visited.has(node)) {
-            visited.add(node);
-            result.push(node);
-            queue.push(...graph[node].filter(neighbor => !visited.has(neighbor)));
-        }
-    }
-    return result;
-}
+function bfs(graph, startNode) {}
 //Dijakstras Alg
 function dijkstra(graph, startNode) {
killedBy: DSA Functions Tests BFS: traversal of graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["A", "B", "C", "D", "E", "F"]
Received: undefined

[Killed] EqualityOperator
index.js:189:12
     const visited = new Set();
     const queue = [startNode];
     const result = [];
-    while (queue.length > 0) {
+    while (queue.length <= 0) {
         const node = queue.shift();
         if (!visited.has(node)) {
killedBy: DSA Functions Tests BFS: traversal of graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   "A",
-   "B",

[Killed] EqualityOperator
index.js:189:12
     const visited = new Set();
     const queue = [startNode];
     const result = [];
-    while (queue.length > 0) {
+    while (queue.length >= 0) {
         const node = queue.shift();
         if (!visited.has(node)) {
killedBy: DSA Functions Tests BFS: traversal of graph
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
index.js:191:13
     const result = [];
     while (queue.length > 0) {
         const node = queue.shift();
-        if (!visited.has(node)) {
+        if (true) {
             visited.add(node);
             result.push(node);
killedBy: DSA Functions Tests BFS: traversal of graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

@@ -3,6 +3,7 @@
    "B",
    "C",

[Killed] BlockStatement
index.js:191:33
     const result = [];
     while (queue.length > 0) {
         const node = queue.shift();
-        if (!visited.has(node)) {
-            visited.add(node);
-            result.push(node);
-            queue.push(...graph[node].filter(neighbor => !visited.has(neighbor)));
-        }
+        if (!visited.has(node)) {}
     }
     return result;
killedBy: DSA Functions Tests BFS: traversal of graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   "A",
-   "B",

[Killed] ArrowFunction
index.js:194:46
         if (!visited.has(node)) {
             visited.add(node);
             result.push(node);
-            queue.push(...graph[node].filter(neighbor => !visited.has(neighbor)));
+            queue.push(...graph[node].filter(() => undefined));
         }
     }
killedBy: DSA Functions Tests BFS: traversal of graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 0

  Array [
    "A",
-   "B",

[Killed] BooleanLiteral
index.js:194:58
         if (!visited.has(node)) {
             visited.add(node);
             result.push(node);
-            queue.push(...graph[node].filter(neighbor => !visited.has(neighbor)));
+            queue.push(...graph[node].filter(neighbor => visited.has(neighbor)));
         }
     }
killedBy: DSA Functions Tests BFS: traversal of graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 0

  Array [
    "A",
-   "B",

[Killed] BlockStatement
index.js:204:31
     const distances = {};
     const visited = {};
     const priorityQueue = [];
-    for (const node in graph) {
-        distances[node] = Infinity;
-    }
+    for (const node in graph) {}
     distances[startNode] = 0;
     priorityQueue.push({ node: startNode, distance: 0 });
killedBy: DSA Functions Tests Dijkstra: shortest path in a small graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Object {
    "A": 0,
-   "B": 1,

[Killed] ConditionalExpression
index.js:209:12
     }
     distances[startNode] = 0;
     priorityQueue.push({ node: startNode, distance: 0 });
-    while (priorityQueue.length > 0) {
+    while (false) {
         priorityQueue.sort((a, b) => a.distance - b.distance);
         const current = priorityQueue.shift();
killedBy: DSA Functions Tests Dijkstra: shortest path in a small graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "A": 0,
-   "B": 1,

[Killed] EqualityOperator
index.js:209:12
     }
     distances[startNode] = 0;
     priorityQueue.push({ node: startNode, distance: 0 });
-    while (priorityQueue.length > 0) {
+    while (priorityQueue.length <= 0) {
         priorityQueue.sort((a, b) => a.distance - b.distance);
         const current = priorityQueue.shift();
killedBy: DSA Functions Tests Dijkstra: shortest path in a small graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "A": 0,
-   "B": 1,

[Survived] ArithmeticOperator
index.js:210:38
     distances[startNode] = 0;
     priorityQueue.push({ node: startNode, distance: 0 });
     while (priorityQueue.length > 0) {
-        priorityQueue.sort((a, b) => a.distance - b.distance);
+        priorityQueue.sort((a, b) => a.distance + b.distance);
         const current = priorityQueue.shift();
         const currentNode = current.node;

[Survived] MethodExpression
index.js:210:9
     distances[startNode] = 0;
     priorityQueue.push({ node: startNode, distance: 0 });
     while (priorityQueue.length > 0) {
-        priorityQueue.sort((a, b) => a.distance - b.distance);
+        priorityQueue;
         const current = priorityQueue.shift();
         const currentNode = current.node;

[Killed] ConditionalExpression
index.js:213:13
         priorityQueue.sort((a, b) => a.distance - b.distance);
         const current = priorityQueue.shift();
         const currentNode = current.node;
-        if (visited[currentNode]) continue;
+        if (true) continue;
         visited[currentNode] = true;
         for (const neighbor in graph[currentNode]) {
killedBy: DSA Functions Tests Dijkstra: shortest path in a small graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "A": 0,
-   "B": 1,

[Survived] ConditionalExpression
index.js:213:13
         priorityQueue.sort((a, b) => a.distance - b.distance);
         const current = priorityQueue.shift();
         const currentNode = current.node;
-        if (visited[currentNode]) continue;
+        if (false) continue;
         visited[currentNode] = true;
         for (const neighbor in graph[currentNode]) {

[Survived] BooleanLiteral
index.js:214:32
         const current = priorityQueue.shift();
         const currentNode = current.node;
         if (visited[currentNode]) continue;
-        visited[currentNode] = true;
+        visited[currentNode] = false;
         for (const neighbor in graph[currentNode]) {
             const distance = graph[currentNode][neighbor];

[Killed] BlockStatement
index.js:215:52
         const currentNode = current.node;
         if (visited[currentNode]) continue;
         visited[currentNode] = true;
-        for (const neighbor in graph[currentNode]) {
-            const distance = graph[currentNode][neighbor];
-            const newDistance = distances[currentNode] + distance;
-            if (newDistance < distances[neighbor]) {
-                distances[neighbor] = newDistance;
-                priorityQueue.push({ node: neighbor, distance: newDistance });
-            }
-        }
+        for (const neighbor in graph[currentNode]) {}
     }
     return distances;
killedBy: DSA Functions Tests Dijkstra: shortest path in a small graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "A": 0,
-   "B": 1,

[Killed] ArithmeticOperator
index.js:217:33
         visited[currentNode] = true;
         for (const neighbor in graph[currentNode]) {
             const distance = graph[currentNode][neighbor];
-            const newDistance = distances[currentNode] + distance;
+            const newDistance = distances[currentNode] - distance;
             if (newDistance < distances[neighbor]) {
                 distances[neighbor] = newDistance;
killedBy: DSA Functions Tests Dijkstra: shortest path in a small graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "A": 0,
-   "B": 1,

[Killed] EqualityOperator
index.js:218:17
         for (const neighbor in graph[currentNode]) {
             const distance = graph[currentNode][neighbor];
             const newDistance = distances[currentNode] + distance;
-            if (newDistance < distances[neighbor]) {
+            if (newDistance >= distances[neighbor]) {
                 distances[neighbor] = newDistance;
                 priorityQueue.push({ node: neighbor, distance: newDistance });
killedBy: DSA Functions Tests Dijkstra: shortest path in a small graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "A": 0,
-   "B": 1,

[Killed] ConditionalExpression
index.js:218:17
         for (const neighbor in graph[currentNode]) {
             const distance = graph[currentNode][neighbor];
             const newDistance = distances[currentNode] + distance;
-            if (newDistance < distances[neighbor]) {
+            if (false) {
                 distances[neighbor] = newDistance;
                 priorityQueue.push({ node: neighbor, distance: newDistance });
killedBy: DSA Functions Tests Dijkstra: shortest path in a small graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "A": 0,
-   "B": 1,

[Killed] BlockStatement
index.js:227:20
     return distances;
 }
 //lcs
-function lcs(X, Y) {
-    const m = X.length, n = Y.length;
-    const dp = Array(m + 1).fill().map(() => Array(n + 1).fill(0));
-    
-    for (let i = 1; i <= m; i++) {
-        for (let j = 1; j <= n; j++) {
-            if (X[i - 1] === Y[j - 1]) {
-                dp[i][j] = dp[i - 1][j - 1] + 1;
-            } else {
-                dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
-            }
-        }
-    }
-    return dp[m][n];
-}
+function lcs(X, Y) {}
 //Longest Increasing Subsequence (LIS)
 function lis(arr) {
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArithmeticOperator
index.js:229:22
 //lcs
 function lcs(X, Y) {
     const m = X.length, n = Y.length;
-    const dp = Array(m + 1).fill().map(() => Array(n + 1).fill(0));
+    const dp = Array(m - 1).fill().map(() => Array(n + 1).fill(0));
     
     for (let i = 1; i <= m; i++) {
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
index.js:229:40
 //lcs
 function lcs(X, Y) {
     const m = X.length, n = Y.length;
-    const dp = Array(m + 1).fill().map(() => Array(n + 1).fill(0));
+    const dp = Array(m + 1).fill().map(() => undefined);
     
     for (let i = 1; i <= m; i++) {
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] EqualityOperator
index.js:231:21
     const m = X.length, n = Y.length;
     const dp = Array(m + 1).fill().map(() => Array(n + 1).fill(0));
     
-    for (let i = 1; i <= m; i++) {
+    for (let i = 1; i < m; i++) {
         for (let j = 1; j <= n; j++) {
             if (X[i - 1] === Y[j - 1]) {
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] UpdateOperator
index.js:231:29
     const m = X.length, n = Y.length;
     const dp = Array(m + 1).fill().map(() => Array(n + 1).fill(0));
     
-    for (let i = 1; i <= m; i++) {
+    for (let i = 1; i <= m; i--) {
         for (let j = 1; j <= n; j++) {
             if (X[i - 1] === Y[j - 1]) {
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] EqualityOperator
index.js:232:25
     const dp = Array(m + 1).fill().map(() => Array(n + 1).fill(0));
     
     for (let i = 1; i <= m; i++) {
-        for (let j = 1; j <= n; j++) {
+        for (let j = 1; j > n; j++) {
             if (X[i - 1] === Y[j - 1]) {
                 dp[i][j] = dp[i - 1][j - 1] + 1;
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] EqualityOperator
index.js:232:25
     const dp = Array(m + 1).fill().map(() => Array(n + 1).fill(0));
     
     for (let i = 1; i <= m; i++) {
-        for (let j = 1; j <= n; j++) {
+        for (let j = 1; j < n; j++) {
             if (X[i - 1] === Y[j - 1]) {
                 dp[i][j] = dp[i - 1][j - 1] + 1;
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] EqualityOperator
index.js:233:17
     
     for (let i = 1; i <= m; i++) {
         for (let j = 1; j <= n; j++) {
-            if (X[i - 1] === Y[j - 1]) {
+            if (X[i - 1] !== Y[j - 1]) {
                 dp[i][j] = dp[i - 1][j - 1] + 1;
             } else {
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] ConditionalExpression
index.js:233:17
     
     for (let i = 1; i <= m; i++) {
         for (let j = 1; j <= n; j++) {
-            if (X[i - 1] === Y[j - 1]) {
+            if (true) {
                 dp[i][j] = dp[i - 1][j - 1] + 1;
             } else {
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 6

[Killed] ArithmeticOperator
index.js:234:28
     for (let i = 1; i <= m; i++) {
         for (let j = 1; j <= n; j++) {
             if (X[i - 1] === Y[j - 1]) {
-                dp[i][j] = dp[i - 1][j - 1] + 1;
+                dp[i][j] = dp[i - 1][j - 1] - 1;
             } else {
                 dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -1

[Killed] ArithmeticOperator
index.js:234:31
     for (let i = 1; i <= m; i++) {
         for (let j = 1; j <= n; j++) {
             if (X[i - 1] === Y[j - 1]) {
-                dp[i][j] = dp[i - 1][j - 1] + 1;
+                dp[i][j] = dp[i + 1][j - 1] + 1;
             } else {
                 dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
index.js:235:20
         for (let j = 1; j <= n; j++) {
             if (X[i - 1] === Y[j - 1]) {
                 dp[i][j] = dp[i - 1][j - 1] + 1;
-            } else {
-                dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
-            }
+            } else {}
         }
     }
killedBy: DSA Functions Tests LCS of "ABCBDAB" and "BDCABB" is 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] BlockStatement
index.js:243:19
     return dp[m][n];
 }
 //Longest Increasing Subsequence (LIS)
-function lis(arr) {
-    const n = arr.length;
-    const dp = Array(n).fill(1);
-    
-    for (let i = 1; i < n; i++) {
-        for (let j = 0; j < i; j++) {
-            if (arr[i] > arr[j]) {
-                dp[i] = Math.max(dp[i], dp[j] + 1);
-            }
-        }
-    }
-    return Math.max(...dp);
-}
+function lis(arr) {}
 //Kruskal’s Algorithm (Minimum Spanning Tree)
 class DisjointSet {
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
index.js:247:33
     const n = arr.length;
     const dp = Array(n).fill(1);
     
-    for (let i = 1; i < n; i++) {
-        for (let j = 0; j < i; j++) {
-            if (arr[i] > arr[j]) {
-                dp[i] = Math.max(dp[i], dp[j] + 1);
-            }
-        }
-    }
+    for (let i = 1; i < n; i++) {}
     return Math.max(...dp);
 }
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] EqualityOperator
index.js:247:21
     const n = arr.length;
     const dp = Array(n).fill(1);
     
-    for (let i = 1; i < n; i++) {
+    for (let i = 1; i >= n; i++) {
         for (let j = 0; j < i; j++) {
             if (arr[i] > arr[j]) {
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] EqualityOperator
index.js:248:25
     const dp = Array(n).fill(1);
     
     for (let i = 1; i < n; i++) {
-        for (let j = 0; j < i; j++) {
+        for (let j = 0; j >= i; j++) {
             if (arr[i] > arr[j]) {
                 dp[i] = Math.max(dp[i], dp[j] + 1);
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] BlockStatement
index.js:248:37
     const dp = Array(n).fill(1);
     
     for (let i = 1; i < n; i++) {
-        for (let j = 0; j < i; j++) {
-            if (arr[i] > arr[j]) {
-                dp[i] = Math.max(dp[i], dp[j] + 1);
-            }
-        }
+        for (let j = 0; j < i; j++) {}
     }
     return Math.max(...dp);
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] ConditionalExpression
index.js:249:17
     
     for (let i = 1; i < n; i++) {
         for (let j = 0; j < i; j++) {
-            if (arr[i] > arr[j]) {
+            if (false) {
                 dp[i] = Math.max(dp[i], dp[j] + 1);
             }
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] EqualityOperator
index.js:249:17
     
     for (let i = 1; i < n; i++) {
         for (let j = 0; j < i; j++) {
-            if (arr[i] > arr[j]) {
+            if (arr[i] <= arr[j]) {
                 dp[i] = Math.max(dp[i], dp[j] + 1);
             }
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 2

[Killed] MethodExpression
index.js:250:25
     for (let i = 1; i < n; i++) {
         for (let j = 0; j < i; j++) {
             if (arr[i] > arr[j]) {
-                dp[i] = Math.max(dp[i], dp[j] + 1);
+                dp[i] = Math.min(dp[i], dp[j] + 1);
             }
         }
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] ArithmeticOperator
index.js:250:41
     for (let i = 1; i < n; i++) {
         for (let j = 0; j < i; j++) {
             if (arr[i] > arr[j]) {
-                dp[i] = Math.max(dp[i], dp[j] + 1);
+                dp[i] = Math.max(dp[i], dp[j] - 1);
             }
         }
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] MethodExpression
index.js:254:12
             }
         }
     }
-    return Math.max(...dp);
+    return Math.min(...dp);
 }
 //Kruskal’s Algorithm (Minimum Spanning Tree)
killedBy: DSA Functions Tests LIS of [10, 22, 9, 33, 21, 50, 41, 60, 80] is 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] BlockStatement
index.js:258:20
 }
 //Kruskal’s Algorithm (Minimum Spanning Tree)
 class DisjointSet {
-    constructor(n) {
-        this.parent = Array(n).fill(0).map((_, idx) => idx);
-        this.rank = Array(n).fill(0);
-    }
+    constructor(n) {}
     find(x) {
         if (this.parent[x] !== x) {
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] ArrowFunction
index.js:259:44
 //Kruskal’s Algorithm (Minimum Spanning Tree)
 class DisjointSet {
     constructor(n) {
-        this.parent = Array(n).fill(0).map((_, idx) => idx);
+        this.parent = Array(n).fill(0).map(() => undefined);
         this.rank = Array(n).fill(0);
     }
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   Object {
-     "u": 2,

[Killed] BlockStatement
index.js:262:13
         this.parent = Array(n).fill(0).map((_, idx) => idx);
         this.rank = Array(n).fill(0);
     }
-    find(x) {
-        if (this.parent[x] !== x) {
-            this.parent[x] = this.find(this.parent[x]);
-        }
-        return this.parent[x];
-    }
+    find(x) {}
     union(x, y) {
         const rootX = this.find(x);
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   Object {
-     "u": 2,

[Survived] ConditionalExpression
index.js:263:13
         this.rank = Array(n).fill(0);
     }
     find(x) {
-        if (this.parent[x] !== x) {
+        if (false) {
             this.parent[x] = this.find(this.parent[x]);
         }

[Survived] BlockStatement
index.js:263:35
         this.rank = Array(n).fill(0);
     }
     find(x) {
-        if (this.parent[x] !== x) {
-            this.parent[x] = this.find(this.parent[x]);
-        }
+        if (this.parent[x] !== x) {}
         return this.parent[x];
     }

[Killed] BlockStatement
index.js:268:17
         }
         return this.parent[x];
     }
-    union(x, y) {
-        const rootX = this.find(x);
-        const rootY = this.find(y);
-        if (rootX !== rootY) {
-            if (this.rank[rootX] > this.rank[rootY]) {
-                this.parent[rootY] = rootX;
-            } else if (this.rank[rootX] < this.rank[rootY]) {
-                this.parent[rootX] = rootY;
-            } else {
-                this.parent[rootY] = rootX;
-                this.rank[rootX]++;
-            }
-        }
-    }
+    union(x, y) {}
 }
 function kruskal(vertices, edges) {
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -9,9 +9,19 @@
      "v": 3,
      "weight": 5,

[Killed] EqualityOperator
index.js:271:13
     union(x, y) {
         const rootX = this.find(x);
         const rootY = this.find(y);
-        if (rootX !== rootY) {
+        if (rootX === rootY) {
             if (this.rank[rootX] > this.rank[rootY]) {
                 this.parent[rootY] = rootX;
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -9,9 +9,19 @@
      "v": 3,
      "weight": 5,
