[Killed] BlockStatement
index.js:271:30
     union(x, y) {
         const rootX = this.find(x);
         const rootY = this.find(y);
-        if (rootX !== rootY) {
-            if (this.rank[rootX] > this.rank[rootY]) {
-                this.parent[rootY] = rootX;
-            } else if (this.rank[rootX] < this.rank[rootY]) {
-                this.parent[rootX] = rootY;
-            } else {
-                this.parent[rootY] = rootX;
-                this.rank[rootX]++;
-            }
-        }
+        if (rootX !== rootY) {}
     }
 }
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -9,9 +9,19 @@
      "v": 3,
      "weight": 5,

[Killed] BlockStatement
index.js:272:54
         const rootX = this.find(x);
         const rootY = this.find(y);
         if (rootX !== rootY) {
-            if (this.rank[rootX] > this.rank[rootY]) {
-                this.parent[rootY] = rootX;
-            } else if (this.rank[rootX] < this.rank[rootY]) {
+            if (this.rank[rootX] > this.rank[rootY]) {} else if (this.rank[rootX] < this.rank[rootY]) {
                 this.parent[rootX] = rootY;
             } else {
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -12,6 +12,11 @@
    Object {
      "u": 0,

[Survived] EqualityOperator
index.js:272:17
         const rootX = this.find(x);
         const rootY = this.find(y);
         if (rootX !== rootY) {
-            if (this.rank[rootX] > this.rank[rootY]) {
+            if (this.rank[rootX] <= this.rank[rootY]) {
                 this.parent[rootY] = rootX;
             } else if (this.rank[rootX] < this.rank[rootY]) {

[Killed] BlockStatement
index.js:274:61
         if (rootX !== rootY) {
             if (this.rank[rootX] > this.rank[rootY]) {
                 this.parent[rootY] = rootX;
-            } else if (this.rank[rootX] < this.rank[rootY]) {
-                this.parent[rootX] = rootY;
-            } else {
+            } else if (this.rank[rootX] < this.rank[rootY]) {} else {
                 this.parent[rootY] = rootX;
                 this.rank[rootX]++;
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -9,9 +9,19 @@
      "v": 3,
      "weight": 5,

[Survived] EqualityOperator
index.js:274:24
         if (rootX !== rootY) {
             if (this.rank[rootX] > this.rank[rootY]) {
                 this.parent[rootY] = rootX;
-            } else if (this.rank[rootX] < this.rank[rootY]) {
+            } else if (this.rank[rootX] <= this.rank[rootY]) {
                 this.parent[rootX] = rootY;
             } else {

[Killed] BlockStatement
index.js:276:20
                 this.parent[rootY] = rootX;
             } else if (this.rank[rootX] < this.rank[rootY]) {
                 this.parent[rootX] = rootY;
-            } else {
-                this.parent[rootY] = rootX;
-                this.rank[rootX]++;
-            }
+            } else {}
         }
     }
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -9,9 +9,19 @@
      "v": 3,
      "weight": 5,

[Survived] UpdateOperator
index.js:278:17
                 this.parent[rootX] = rootY;
             } else {
                 this.parent[rootY] = rootX;
-                this.rank[rootX]++;
+                this.rank[rootX]--;
             }
         }

[Killed] BlockStatement
index.js:283:35
         }
     }
 }
-function kruskal(vertices, edges) {
-    const ds = new DisjointSet(vertices);
-    edges.sort((a, b) => a.weight - b.weight);
-    const mst = [];
-    for (const edge of edges) {
-        const { u, v, weight } = edge;
-        if (ds.find(u) !== ds.find(v)) {
-            ds.union(u, v);
-            mst.push(edge);
-        }
-    }
-    return mst;
-}
+function kruskal(vertices, edges) {}
 //Prims
 function prim(graph, start) {
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"u": 2, "v": 3, "weight": 4}, {"u": 0, "v": 3, "weight": 5}, {"u": 0, "v": 1, "weight": 10}]
Received: undefined

[Killed] MethodExpression
index.js:285:5
 }
 function kruskal(vertices, edges) {
     const ds = new DisjointSet(vertices);
-    edges.sort((a, b) => a.weight - b.weight);
+    edges;
     const mst = [];
     for (const edge of edges) {
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

  Array [
    Object {
-     "u": 2,

[Killed] ArithmeticOperator
index.js:285:26
 }
 function kruskal(vertices, edges) {
     const ds = new DisjointSet(vertices);
-    edges.sort((a, b) => a.weight - b.weight);
+    edges.sort((a, b) => a.weight + b.weight);
     const mst = [];
     for (const edge of edges) {
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

  Array [
    Object {
-     "u": 2,

[Killed] BlockStatement
index.js:287:31
     const ds = new DisjointSet(vertices);
     edges.sort((a, b) => a.weight - b.weight);
     const mst = [];
-    for (const edge of edges) {
-        const { u, v, weight } = edge;
-        if (ds.find(u) !== ds.find(v)) {
-            ds.union(u, v);
-            mst.push(edge);
-        }
-    }
+    for (const edge of edges) {}
     return mst;
 }
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   Object {
-     "u": 2,

[Killed] ConditionalExpression
index.js:289:13
     const mst = [];
     for (const edge of edges) {
         const { u, v, weight } = edge;
-        if (ds.find(u) !== ds.find(v)) {
+        if (false) {
             ds.union(u, v);
             mst.push(edge);
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   Object {
-     "u": 2,

[Killed] BlockStatement
index.js:289:40
     const mst = [];
     for (const edge of edges) {
         const { u, v, weight } = edge;
-        if (ds.find(u) !== ds.find(v)) {
-            ds.union(u, v);
-            mst.push(edge);
-        }
+        if (ds.find(u) !== ds.find(v)) {}
     }
     return mst;
killedBy: DSA Functions Tests Kruskal’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   Object {
-     "u": 2,

[Killed] BooleanLiteral
index.js:299:46
 //Prims
 function prim(graph, start) {
     const vertices = graph.length;
-    const visited = new Array(vertices).fill(false);
+    const visited = new Array(vertices).fill(true);
     const result = [];
     const minEdge = new Array(vertices).fill(Infinity);
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
index.js:302:20
     const visited = new Array(vertices).fill(false);
     const result = [];
     const minEdge = new Array(vertices).fill(Infinity);
-    const parent = new Array(vertices).fill(null);
+    const parent = new Array().fill(null);
     
     minEdge[start] = 0;
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
index.js:306:25
     
     minEdge[start] = 0;
     
-    for (let count = 0; count < vertices - 1; count++) {
+    for (let count = 0; false; count++) {
       let u = -1;
       for (let i = 0; i < vertices; i++) {
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Array [
-   Array [
-     0,

[Killed] ArithmeticOperator
index.js:306:33
     
     minEdge[start] = 0;
     
-    for (let count = 0; count < vertices - 1; count++) {
+    for (let count = 0; count < vertices + 1; count++) {
       let u = -1;
       for (let i = 0; i < vertices; i++) {
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] UnaryOperator
index.js:307:15
     minEdge[start] = 0;
     
     for (let count = 0; count < vertices - 1; count++) {
-      let u = -1;
+      let u = +1;
       for (let i = 0; i < vertices; i++) {
         if (!visited[i] && (u === -1 || minEdge[i] < minEdge[u])) {
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 2

@@ -8,15 +8,10 @@
      0,
      2,

[Killed] ConditionalExpression
index.js:308:23
     
     for (let count = 0; count < vertices - 1; count++) {
       let u = -1;
-      for (let i = 0; i < vertices; i++) {
+      for (let i = 0; false; i++) {
         if (!visited[i] && (u === -1 || minEdge[i] < minEdge[u])) {
           u = i;
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
index.js:308:42
     
     for (let count = 0; count < vertices - 1; count++) {
       let u = -1;
-      for (let i = 0; i < vertices; i++) {
-        if (!visited[i] && (u === -1 || minEdge[i] < minEdge[u])) {
-          u = i;
-        }
-      }
+      for (let i = 0; i < vertices; i++) {}
   
       visited[u] = true;
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
index.js:309:13
     for (let count = 0; count < vertices - 1; count++) {
       let u = -1;
       for (let i = 0; i < vertices; i++) {
-        if (!visited[i] && (u === -1 || minEdge[i] < minEdge[u])) {
+        if (false) {
           u = i;
         }
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
index.js:309:29
     for (let count = 0; count < vertices - 1; count++) {
       let u = -1;
       for (let i = 0; i < vertices; i++) {
-        if (!visited[i] && (u === -1 || minEdge[i] < minEdge[u])) {
+        if (!visited[i] && (false || minEdge[i] < minEdge[u])) {
           u = i;
         }
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BooleanLiteral
index.js:314:20
         }
       }
   
-      visited[u] = true;
+      visited[u] = false;
   
       for (let v = 0; v < vertices; v++) {
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 2

@@ -8,15 +8,10 @@
      0,
      2,

[Killed] ConditionalExpression
index.js:316:23
   
       visited[u] = true;
   
-      for (let v = 0; v < vertices; v++) {
+      for (let v = 0; false; v++) {
         if (graph[u][v] !== 0 && !visited[v] && graph[u][v] < minEdge[v]) {
           minEdge[v] = graph[u][v];
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Array [
-   Array [
-     0,

[Killed] BlockStatement
index.js:316:42
   
       visited[u] = true;
   
-      for (let v = 0; v < vertices; v++) {
-        if (graph[u][v] !== 0 && !visited[v] && graph[u][v] < minEdge[v]) {
-          minEdge[v] = graph[u][v];
-          parent[v] = u;
-        }
-      }
+      for (let v = 0; v < vertices; v++) {}
     }
   
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Array [
-   Array [
-     0,

[Killed] ConditionalExpression
index.js:317:13
       visited[u] = true;
   
       for (let v = 0; v < vertices; v++) {
-        if (graph[u][v] !== 0 && !visited[v] && graph[u][v] < minEdge[v]) {
+        if (false) {
           minEdge[v] = graph[u][v];
           parent[v] = u;
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Array [
-   Array [
-     0,

[Killed] ConditionalExpression
index.js:317:49
       visited[u] = true;
   
       for (let v = 0; v < vertices; v++) {
-        if (graph[u][v] !== 0 && !visited[v] && graph[u][v] < minEdge[v]) {
+        if (graph[u][v] !== 0 && !visited[v] && true) {
           minEdge[v] = graph[u][v];
           parent[v] = u;
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -3,18 +3,18 @@
      0,
      1,

[Killed] EqualityOperator
index.js:324:21
       }
     }
   
-    for (let i = 0; i < vertices; i++) {
+    for (let i = 0; i <= vertices; i++) {
       if (parent[i] !== null) {
         result.push([parent[i], i, graph[parent[i]][i]]);
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '5')

[Killed] BlockStatement
index.js:324:40
       }
     }
   
-    for (let i = 0; i < vertices; i++) {
-      if (parent[i] !== null) {
-        result.push([parent[i], i, graph[parent[i]][i]]);
-      }
-    }
+    for (let i = 0; i < vertices; i++) {}
   
     return result;
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Array [
-   Array [
-     0,

[Killed] BlockStatement
index.js:325:31
     }
   
     for (let i = 0; i < vertices; i++) {
-      if (parent[i] !== null) {
-        result.push([parent[i], i, graph[parent[i]][i]]);
-      }
+      if (parent[i] !== null) {}
     }
   
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Array [
-   Array [
-     0,

[Killed] ConditionalExpression
index.js:325:11
     }
   
     for (let i = 0; i < vertices; i++) {
-      if (parent[i] !== null) {
+      if (true) {
         result.push([parent[i], i, graph[parent[i]][i]]);
       }
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
index.js:326:21
   
     for (let i = 0; i < vertices; i++) {
       if (parent[i] !== null) {
-        result.push([parent[i], i, graph[parent[i]][i]]);
+        result.push([]);
       }
     }
killedBy: DSA Functions Tests Prim’s algorithm finds MST for given graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 20
+ Received  +  4

  Array [
-   Array [
-     0,

[Killed] ArrayDeclaration
index.js:335:20
   
 //RabinKarp
 function rabinKarp(text, pattern) {
-    const result = [];
+    const result = ["Stryker was here"];
     const base = 256; // Size of the alphabet
     const prime = 101; // A prime number for hashing
killedBy: DSA Functions Tests Rabin-Karp finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "Stryker was here",
    4,

[Killed] EqualityOperator
index.js:353:21
       textHash = (base * textHash + text.charCodeAt(i)) % prime;
     }
   
-    for (let i = 0; i <= n - m; i++) {
+    for (let i = 0; i > n - m; i++) {
       if (patternHash === textHash) {
         let match = true;
killedBy: DSA Functions Tests Rabin-Karp finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   4,
- ]

[Killed] UpdateOperator
index.js:356:32
     for (let i = 0; i <= n - m; i++) {
       if (patternHash === textHash) {
         let match = true;
-        for (let j = 0; j < m; j++) {
+        for (let j = 0; j < m; j--) {
           if (text[i + j] !== pattern[j]) {
             match = false;
killedBy: DSA Functions Tests Rabin-Karp finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   4,
- ]

[Killed] BlockStatement
index.js:365:22
         if (match) result.push(i);
       }
   
-      if (i < n - m) {
-        textHash = (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) % prime;
-        if (textHash < 0) textHash += prime;
-      }
+      if (i < n - m) {}
     }
   
killedBy: DSA Functions Tests Rabin-Karp finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   4,
- ]

[Killed] ArithmeticOperator
index.js:366:21
       }
   
       if (i < n - m) {
-        textHash = (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) % prime;
+        textHash = (base / (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) % prime;
         if (textHash < 0) textHash += prime;
       }
killedBy: DSA Functions Tests Rabin-Karp finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   4,
- ]

[Killed] ArithmeticOperator
index.js:366:82
       }
   
       if (i < n - m) {
-        textHash = (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) % prime;
+        textHash = (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i - m)) % prime;
         if (textHash < 0) textHash += prime;
       }
killedBy: DSA Functions Tests Rabin-Karp finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   4,
- ]

[Killed] ConditionalExpression
index.js:367:13
   
       if (i < n - m) {
         textHash = (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) % prime;
-        if (textHash < 0) textHash += prime;
+        if (false) textHash += prime;
       }
     }
killedBy: DSA Functions Tests Rabin-Karp finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   4,
- ]

[Killed] EqualityOperator
index.js:367:13
   
       if (i < n - m) {
         textHash = (base * (textHash - text.charCodeAt(i) * h) + text.charCodeAt(i + m)) % prime;
-        if (textHash < 0) textHash += prime;
+        if (textHash >= 0) textHash += prime;
       }
     }
killedBy: DSA Functions Tests Rabin-Karp finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   4,
- ]

[NoCoverage] BlockStatement
index.js:374:34
     return result;
   }
   
-function hash(str, length, d, q) {
-    let h = 0;
-    for (let i = 0; i < length; i++) {
-        h = (h * d + str.charCodeAt(i)) % q;
-    }
-    return h;
-}
+function hash(str, length, d, q) {}
 function rehash(text, hText, i, m, d, q) {
     hText = (hText - text.charCodeAt(i) * Math.pow(d, m - 1)) * d + text.charCodeAt(i + m);

[NoCoverage] ConditionalExpression
index.js:376:21
   
 function hash(str, length, d, q) {
     let h = 0;
-    for (let i = 0; i < length; i++) {
+    for (let i = 0; false; i++) {
         h = (h * d + str.charCodeAt(i)) % q;
     }

[NoCoverage] BlockStatement
index.js:376:38
   
 function hash(str, length, d, q) {
     let h = 0;
-    for (let i = 0; i < length; i++) {
-        h = (h * d + str.charCodeAt(i)) % q;
-    }
+    for (let i = 0; i < length; i++) {}
     return h;
 }

[NoCoverage] ArithmeticOperator
index.js:377:13
 function hash(str, length, d, q) {
     let h = 0;
     for (let i = 0; i < length; i++) {
-        h = (h * d + str.charCodeAt(i)) % q;
+        h = (h * d + str.charCodeAt(i)) * q;
     }
     return h;

[NoCoverage] ArithmeticOperator
index.js:377:14
 function hash(str, length, d, q) {
     let h = 0;
     for (let i = 0; i < length; i++) {
-        h = (h * d + str.charCodeAt(i)) % q;
+        h = (h / d + str.charCodeAt(i)) % q;
     }
     return h;

[NoCoverage] BlockStatement
index.js:381:42
     }
     return h;
 }
-function rehash(text, hText, i, m, d, q) {
-    hText = (hText - text.charCodeAt(i) * Math.pow(d, m - 1)) * d + text.charCodeAt(i + m);
-    return (hText + q) % q;
-}
+function rehash(text, hText, i, m, d, q) {}
 //KMP
 function KMPSearch(text, pattern) {

[NoCoverage] ArithmeticOperator
index.js:382:85
     return h;
 }
 function rehash(text, hText, i, m, d, q) {
-    hText = (hText - text.charCodeAt(i) * Math.pow(d, m - 1)) * d + text.charCodeAt(i + m);
+    hText = (hText - text.charCodeAt(i) * Math.pow(d, m - 1)) * d + text.charCodeAt(i - m);
     return (hText + q) % q;
 }

[NoCoverage] ArithmeticOperator
index.js:382:14
     return h;
 }
 function rehash(text, hText, i, m, d, q) {
-    hText = (hText - text.charCodeAt(i) * Math.pow(d, m - 1)) * d + text.charCodeAt(i + m);
+    hText = (hText + text.charCodeAt(i) * Math.pow(d, m - 1)) * d + text.charCodeAt(i + m);
     return (hText + q) % q;
 }

[NoCoverage] ArithmeticOperator
index.js:383:13
 }
 function rehash(text, hText, i, m, d, q) {
     hText = (hText - text.charCodeAt(i) * Math.pow(d, m - 1)) * d + text.charCodeAt(i + m);
-    return (hText + q) % q;
+    return (hText - q) % q;
 }
 //KMP

[NoCoverage] ArithmeticOperator
index.js:383:12
 }
 function rehash(text, hText, i, m, d, q) {
     hText = (hText - text.charCodeAt(i) * Math.pow(d, m - 1)) * d + text.charCodeAt(i + m);
-    return (hText + q) % q;
+    return (hText + q) * q;
 }
 //KMP

[Killed] BlockStatement
index.js:386:35
     return (hText + q) % q;
 }
 //KMP
-function KMPSearch(text, pattern) {
-    const lps = computeLPSArray(pattern);
-    const result = [];
-    let i = 0, j = 0;
-    while (i < text.length) {
-        if (pattern[j] === text[i]) {
-            i++;
-            j++;
-        }
-        if (j === pattern.length) {
-            result.push(i - j);
-            j = lps[j - 1];
-        } else if (i < text.length && pattern[j] !== text[i]) {
-            if (j !== 0) {
-                j = lps[j - 1];
-            } else {
-                i++;
-            }
-        }
-    }
-    return result;
-}
+function KMPSearch(text, pattern) {}
 function computeLPSArray(pattern) {
     const lps = Array(pattern.length).fill(0);
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [0, 2]
Received: undefined

[Killed] ArrayDeclaration
index.js:388:20
 //KMP
 function KMPSearch(text, pattern) {
     const lps = computeLPSArray(pattern);
-    const result = [];
+    const result = ["Stryker was here"];
     let i = 0, j = 0;
     while (i < text.length) {
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "Stryker was here",
    0,

[Killed] EqualityOperator
index.js:390:12
     const lps = computeLPSArray(pattern);
     const result = [];
     let i = 0, j = 0;
-    while (i < text.length) {
+    while (i >= text.length) {
         if (pattern[j] === text[i]) {
             i++;
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   0,
-   2,

[Killed] ConditionalExpression
index.js:390:12
     const lps = computeLPSArray(pattern);
     const result = [];
     let i = 0, j = 0;
-    while (i < text.length) {
+    while (false) {
         if (pattern[j] === text[i]) {
             i++;
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   0,
-   2,

[Timeout] ConditionalExpression
index.js:391:13
     const result = [];
     let i = 0, j = 0;
     while (i < text.length) {
-        if (pattern[j] === text[i]) {
+        if (false) {
             i++;
             j++;

[Timeout] BlockStatement
index.js:391:37
     const result = [];
     let i = 0, j = 0;
     while (i < text.length) {
-        if (pattern[j] === text[i]) {
-            i++;
-            j++;
-        }
+        if (pattern[j] === text[i]) {}
         if (j === pattern.length) {
             result.push(i - j);

[Killed] ConditionalExpression
index.js:395:13
             i++;
             j++;
         }
-        if (j === pattern.length) {
+        if (false) {
             result.push(i - j);
             j = lps[j - 1];
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   0,
-   2,

[Timeout] EqualityOperator
index.js:395:13
             i++;
             j++;
         }
-        if (j === pattern.length) {
+        if (j !== pattern.length) {
             result.push(i - j);
             j = lps[j - 1];

[Killed] ArithmeticOperator
index.js:396:25
             j++;
         }
         if (j === pattern.length) {
-            result.push(i - j);
+            result.push(i + j);
             j = lps[j - 1];
         } else if (i < text.length && pattern[j] !== text[i]) {
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   2,

[Killed] LogicalOperator
index.js:398:20
         if (j === pattern.length) {
             result.push(i - j);
             j = lps[j - 1];
-        } else if (i < text.length && pattern[j] !== text[i]) {
+        } else if (i < text.length || pattern[j] !== text[i]) {
             if (j !== 0) {
                 j = lps[j - 1];
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   0,
-   2,

[Killed] ConditionalExpression
index.js:398:39
         if (j === pattern.length) {
             result.push(i - j);
             j = lps[j - 1];
-        } else if (i < text.length && pattern[j] !== text[i]) {
+        } else if (i < text.length && true) {
             if (j !== 0) {
                 j = lps[j - 1];
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   0,
-   2,

[Timeout] BlockStatement
index.js:399:26
             result.push(i - j);
             j = lps[j - 1];
         } else if (i < text.length && pattern[j] !== text[i]) {
-            if (j !== 0) {
-                j = lps[j - 1];
-            } else {
+            if (j !== 0) {} else {
                 i++;
             }

[Survived] ConditionalExpression
index.js:399:17
             result.push(i - j);
             j = lps[j - 1];
         } else if (i < text.length && pattern[j] !== text[i]) {
-            if (j !== 0) {
+            if (false) {
                 j = lps[j - 1];
             } else {

[Killed] BlockStatement
index.js:408:35
     }
     return result;
 }
-function computeLPSArray(pattern) {
-    const lps = Array(pattern.length).fill(0);
-    let length = 0;
-    let i = 1;
-    while (i < pattern.length) {
-        if (pattern[i] === pattern[length]) {
-            length++;
-            lps[i] = length;
-            i++;
-        } else {
-            if (length !== 0) {
-                length = lps[length - 1];
-            } else {
-                i++;
-            }
-        }
-    }
-    return lps;
-}
+function computeLPSArray(pattern) {}
   
 // // MAIN FUNCTION TO TEST --------------------------------
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: TypeError: Cannot read properties of undefined (reading '3')

[Timeout] ArrayDeclaration
index.js:409:17
     return result;
 }
 function computeLPSArray(pattern) {
-    const lps = Array(pattern.length).fill(0);
+    const lps = Array().fill(0);
     let length = 0;
     let i = 1;

[Killed] ConditionalExpression
index.js:412:12
     const lps = Array(pattern.length).fill(0);
     let length = 0;
     let i = 1;
-    while (i < pattern.length) {
+    while (false) {
         if (pattern[i] === pattern[length]) {
             length++;
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
-   2,
