[Killed] EqualityOperator
index.js:412:12
     const lps = Array(pattern.length).fill(0);
     let length = 0;
     let i = 1;
-    while (i < pattern.length) {
+    while (i >= pattern.length) {
         if (pattern[i] === pattern[length]) {
             length++;
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
-   2,

[Timeout] BlockStatement
index.js:417:16
             length++;
             lps[i] = length;
             i++;
-        } else {
-            if (length !== 0) {
-                length = lps[length - 1];
-            } else {
-                i++;
-            }
-        }
+        } else {}
     }
     return lps;

[Killed] EqualityOperator
index.js:418:17
             lps[i] = length;
             i++;
         } else {
-            if (length !== 0) {
+            if (length === 0) {
                 length = lps[length - 1];
             } else {
killedBy: DSA Functions Tests KMP finds pattern in text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    0,
-   2,

[NoCoverage] BlockStatement
index.js:418:31
             lps[i] = length;
             i++;
         } else {
-            if (length !== 0) {
-                length = lps[length - 1];
-            } else {
+            if (length !== 0) {} else {
                 i++;
             }

[NoCoverage] ArithmeticOperator
index.js:419:30
             i++;
         } else {
             if (length !== 0) {
-                length = lps[length - 1];
+                length = lps[length + 1];
             } else {
                 i++;

[Timeout] BlockStatement
index.js:420:20
         } else {
             if (length !== 0) {
                 length = lps[length - 1];
-            } else {
-                i++;
-            }
+            } else {}
         }
     }
